Notebook purpose

- Sense-check and explore calculated account balances

In [29]:
import os
import sys

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

sys.path.append('/Users/fgu/dev/projects/entropy')
import entropy.helpers.aws as aws
import entropy.data.cleaners as cl
import entropy.data.creators as cr

sns.set_style('whitegrid')
pd.set_option('display.max_rows', 120)
pd.set_option('display.max_columns', 120)
pd.set_option('max_colwidth', None)
%config InlineBackend.figure_format = 'retina'
%load_ext autoreload
%autoreload 2

plotargs = dict(figsize = (10, 4))

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [19]:
SAMPLE = 'X77'
fp = f'~/tmp/entropy_{SAMPLE}.parquet'

df = aws.read_parquet(fp)
print('Rows: {:,.0f}\nUsers: {}'.format(df.shape[0], df.user_id.nunique()))
df.head(1)

Rows: 1,296,248
Users: 428

,id,date,user_id,amount,desc,merchant,tag_group,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,updated_flag,ym,balance,income,savings
0,688261,2012-01-03,777,400.0,<mdbremoved> - s/o,NaN,transfers,tsransfer,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2017-11-13,True,364.220001,non merchant mbl,transfers,other account,other account,u,201201,-1451.075562,NaN,False

In [20]:
s = df[df.savings]

In [28]:
df.groupby(['user_id', 'date']).income.first().describe()

count    174511.000000
mean       7006.674652
std       18805.916684
min       -2168.605748
25%          11.280000
50%         297.989990
75%        5422.062640
max      192000.000000
Name: income, dtype: float64

In [18]:
s.groupby

,id,date,user_id,amount,desc,merchant,tag_group,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,updated_flag,ym,balance,income,savings
9593,55112921,2015-01-23,52777,20.0,standing order <mdbremoved> sto,NaN,transfers,savings,False,pe6 0,2014-05-08,NaN,1965.0,2015-01-20,356594,2015-09-19 00:00:00,barclays,current,2015-01-24,2020-05-19,True,NaN,non merchant mbl,isa,NaN,isa,u,201501,NaN,5.505,True
9618,56492095,2015-01-30,52777,20.0,standing order <mdbremoved> sto,NaN,transfers,savings,False,pe6 0,2014-05-08,NaN,1965.0,2015-01-20,356594,2015-09-19 00:00:00,barclays,current,2015-01-31,2020-05-19,True,NaN,non merchant mbl,isa,NaN,isa,u,201501,NaN,5.505,True
9656,57946499,2015-02-06,52777,20.0,standing order <mdbremoved> sto,NaN,transfers,savings,False,pe6 0,2014-05-08,NaN,1965.0,2015-01-20,356594,2015-09-19 00:00:00,barclays,current,2015-02-07,2020-05-19,True,NaN,non merchant mbl,isa,NaN,isa,u,201502,NaN,5.505,True
9675,60353891,2015-02-13,52777,20.0,standing order <mdbremoved> sto,NaN,transfers,savings,False,pe6 0,2014-05-08,NaN,1965.0,2015-01-20,356594,2015-09-19 00:00:00,barclays,current,2015-02-21,2020-05-19,True,NaN,non merchant mbl,isa,NaN,isa,u,201502,NaN,5.505,True
9704,60353870,2015-02-20,52777,20.0,standing order <mdbremoved> sto,NaN,transfers,savings,False,pe6 0,2014-05-08,NaN,1965.0,2015-01-20,356594,2015-09-19 00:00:00,barclays,current,2015-02-21,2020-05-19,True,NaN,non merchant mbl,isa,NaN,isa,u,201502,NaN,5.505,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110815,747727869,2017-09-01,578777,200.0,<mdbremoved> sto,NaN,transfers,savings,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,NaN,isa,NaN,isa,c,201709,-324.187012,NaN,True
110917,747727817,2017-10-02,578777,200.0,<mdbremoved> sto,NaN,transfers,savings,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,NaN,isa,NaN,isa,c,201710,208.583008,NaN,True
110998,747727766,2017-11-01,578777,200.0,<mdbremoved> sto,NaN,transfers,savings,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,NaN,isa,NaN,isa,c,201711,-556.186768,NaN,True
111093,747727697,2017-12-01,578777,200.0,<mdbremoved> sto,NaN,transfers,savings,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,NaN,isa,NaN,isa,c,201712,-1204.676636,NaN,True
111202,747727616,2018-01-02,578777,200.0,<mdbremoved> sto,NaN,transfers,savings,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,NaN,isa,NaN,isa,c,201801,-261.178650,NaN,True